import unittest
from approx import approx_func
import numpy as np

x1 = np.array([0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 66])
y1 = np.array([4.88, 4.73, 4.66, 4.61, 4.52, 4.35, 4.10, 3.74, 3.28, 2.73, 2.11, 1.45, 0.77, 0])


class FuncTest(unittest.TestCase):
    def test_func(self):
        """ Тест функции approx_function на вывод правильных значений полинома в точках Х """
        self.assertEqual(approx_func.approx_function(x1, y1), [4.88000000564266, 4.7300000012353465, 4.660000000813202, 4.6100000005835495,
                                                               4.520000000904094, 4.35000000083709, 4.10000000070566, 3.740000000676173,
                                                               3.280000000313108, 2.72999999928331, 2.1099999992269054, 1.4499999986516814,
                                                               0.7699999972371163, -5.724149154673341e-09])


if __name__ == "__main__":
    unittest.main()
